{
  "navigation": {
    "primaryNavigation": {
      "home": "home",
      "about": "about",
      "work": "work",
      "contact": "contact",
      "legal": "Legal"
    }
  },
  "home": {
    "greeting": "Hello!",
    "phrase1": "My name is",
    "phrase2": "Corentin Kittel",
    "phrase3": "I'm a passionate ",

    "phrase4": "full-stack developer",
    "phrase5": "with a keen appreciation for",
    "phrase6": "UX/UI design",
    "project": "See my projects",
    "about": "More about me"
  },
  "about": {
    "title": "About",

    "text1": "Hello! My name is ",
    "text2": "Corentin Kittel",
    "text3": "I am a",
    "text4": "full-stack developer",
    "text5": "with a keen interest in interface design and user experience. I began learning web development in 2022, and since then, I haven't stopped learning and creating. I have a passion for crafting websites and web applications that are both visually appealing and functional. I enjoy working with modern technologies and am always on the lookout for new things to learn."
  },
  "project": {
    "title": "Work"
  },

  "contact": {
    "social": "Social medias"
  },

  "loading": {
    "phrase": "Loading"
  },
  "form": {
    "firstname": "Firstname",
    "lastname": "Lastname",
    "subject": "Subject",
    "submit": "Submit",
    "success": "Your submission has been sent !",
    "error": "An error occured, please try again later.",
    "subscribe": "Subscribe",
    "newsletterSuccess": "You have been successfully subscribed to our newsletter !"
  },
  "projectPage": {
    "category": "Category",
    "year": "Year",
    "status": {
      "label": "Status",
      "completed": "Finished",
      "inProgress": "In progress"
    },
    "url": "Go to the website",
    "nextProject": "Next",
    "previousProject": "Previous",
    "back": "Retour à la liste des projets"
  },
  "reCaptcha": {
    "formPhrase": {
      "1": "This site is protected by reCAPTCHA and the Google ",
      "2": "Privacy Policy ",
      "3": "and ",
      "4": "Terms of Service ",
      "5": "apply."
    }
  },

  "legal": {
    "title": "Legal Notice",
    "law": "In accordance with the provisions of articles 6-III and 19 of Law number 2004-575 of June 21, 2004, for Trust in the Digital Economy, known as the L.C.E.N., we inform visitors to the website: corentinkittel.fr",
    "law2": "The attached data:",
    "legalInformation": {
      "heading": "1. Legal Information:",
      "content": "The corentinkittel.fr website is the exclusive property of the Association de droit local Corentin Kittel, which owns it.",
      "content2": "Autoentreprise Monsieur Corentin Kittel - Phone number: 0672357606",
      "content3": "55 Avenue de la forêt noire 67000 Strasbourg registered with the Registry of Commerce and Companies (RCS) under number 90286337200022",

      "content5": "Email address: contact@corentinkittel.fr",
      "webmaster": "The Designer and Webmaster of the site is: Kittel Corentin",
      "webmasterEmail": "Email address: contact@corentinkittel.fr",
      "hosting1": "Web hosting: Vercel Inc",
      "hosting2": "Foreign Business Corporation",
      "hosting3": "Registered office of the hosting provider: 650 CALIFORNIA ST, FLOOR 7, Suite 06-104 SAN FRANCISCO, 94108, CA, United States"
    },
    "principles": {
      "heading": "2. Presentation and Principle:",
      "content": "Any internet user connecting to and using the corentinkittel.fr website is considered a user of the website. The corentinkittel.fr website brings together various services, as is, made available to users. It is specified here that users must remain honest and act in good faith towards other users and the creator of the corentinkittel.fr site. Kittel Corentin strives to provide the most accurate information on the corentinkittel.fr site (subject to changes made since it was posted), but cannot attest to the accuracy, completeness, and timeliness of the information disseminated on its website, whether or not it is his own. As a result, the user acknowledges using the information provided (for indicative purposes, not exhaustive, and subject to change) under his exclusive responsibility."
    },
    "accessibility": {
      "heading": "3. Accessibility:",
      "content": "The corentinkittel.fr website is, in principle, accessible to users 24/24, 7/7, except in the case of maintenance, programmed or not, for the needs of its maintenance or in case of force majeure. In the event of impossibility of access to the service, corentinkittel.fr undertakes to do its best to restore access to the following site and will then attempt to inform users in advance of the intervention dates and times. Being subject only to a means servitude, corentinkittel.fr cannot be designated as responsible for damages, of any nature whatsoever."
    },
    "property": {
      "heading": "4. Intellectual Property Right:",
      "content": "Corentin Kittel is the exclusive owner of all intellectual property rights or holds the rights and permissions to use all elements accessible on the website, both on the structure and on the articles and texts, images, graphics, icons, sounds, software... Any total or partial reproduction of the corentinkittel.fr site, display, modification, update in whole or in part of any of these elements, regardless of the means or process used, is strictly prohibited, unless prior written authorization from Corentin Kittel, director of the site, even partial of the corentinkittel.fr site, display, editing, update in whole or in part of any of these elements, whatever the means or technique used, is prohibited, unless prior written authorization from Corentin Kittel, owner of the website at the following email: contact@corentinkittel.fr, otherwise it will be considered in the same way as counterfeiting and liable to prosecution in accordance with the provisions of multiple articles L.335-2 and following of the Intellectual Property Code."
    },
    "cookies": {
      "heading": "5. Cookies & Hypertext Links:",
      "content": "The corentinkittel.fr website contains various clickable URLs to other sites (partnerships, source sites...) posted following validation by Kittel Corentin. However, Kittel Corentin does not have the ability to control all the elements of the different sites visited and therefore declines any responsibility for any risks of illicit content. "
    },
    "protection": {
      "heading": "6. Protection of Persons and Property - Handling of Personal Data:",
      "content": "In France, personal data is notably protected by Law No. 78-87 of January 6, 1978, as well as Law No. 2004-801 of August 6, 2004, Article L. 226-13 of the Penal Code and Directive European of October 24, 1995.",
      "content2": "On the corentinkittel.fr website, Corentin Kittel does not collect personal information (according to Article 4 of Law No. 78-17 of January 6, 1978) relating to the user only for the necessity of certain services offered by the corentinkittel.fr website. The user provides the information knowingly, especially when entering it himself. It is therefore specified to the user of the corentinkittel.fr internal website the duty or not to mention this data. In accordance with the provisions of Articles 38 and others of Law 78-17 of January 6, 1978 concerning data processing, files, and various freedoms, any user has a right of access, rectification, deletion, and opposition to personal information concerning him. To use it, send a request by email: contact@corentinkittel.fr or by handwritten letter duly signed, attached with a copy of the identity document with the signature of the document holder, specifying the address to which a response should be returned.",
      "content3": "No personal information of the user of the corentinkittel.fr website is published without the user's knowledge, exchanged, transferred, sold on any medium to third parties.",
      "content4": "The corentinkittel.fr website complies with the GDPR."
    }
  },

  "newsletter": {
    "heading": "Subscribe to our Newsletter!",
    "content": "To not miss any of our events and stay updated on the latest from our label."
  },
  "title": {
    "contact-us": "Contact us",
    "gallery": "Gallery"
  },
  "values": {
    "risk-reduction": "risk reduction"
  },
  "metadata": {
    "landing": {
      "title": "Corentin Kittel | Full-Stack Developer & UX/UI Designer",
      "description": "Explore the professional profile of Corentin Kittel, a Full-Stack developer passionate about the art of UX/UI Design. Dive into his diverse portfolio and discover how he combines strong technical expertise with aesthetic sensitivity to create exceptional user experiences. Connect with Corentin to discuss your web development projects and user experience enhancements."
    },
    "about": {
      "title": "About Corentin Kittel | Full-Stack Developer & UX/UI Designer",
      "description": "Explore the journey of Corentin Kittel, a full-stack developer passionate about interface design and user experience. Since 2022, I have dedicated my time to deepening my knowledge, creating websites and applications that blend elegance with functionality. Discover my passion for modern technologies and my constant quest for new skills to provide innovative solutions."
    },
    "contact": {
      "title": "Contact Corentin Kittel | Full-Stack Developer & UX/UI Designer",
      "description": "Get in touch with Corentin Kittel, a full-stack developer passionate about interface design and user experience. Whether you have questions, projects to discuss, or collaboration opportunities, I am here to assist. Use the provided contact information to initiate a conversation and explore how we can work together to bring your digital ideas to life."
    },
    "work": {
      "title": "Portfolio of Corentin Kittel | Full-Stack Developer & UX/UI Designer",
      "description": "Explore the project portfolio of Corentin Kittel, a full-stack developer passionate about interface design and user experience."
    },
    "legalinformation": {
      "title": "Legal Information",
      "description": "Check out the legal information for complete transparency. Discover the legal and regulatory information framing the platform. Corentin Kittel is committed to complying with all applicable standards. Visit the legal information page for clear and precise details about my legal framework."
    },
    "mtonarchi": {
      "title": "Mtonarchi | Project by Corentin Kittel",
      "description": "Discover Mtonarchi, a project by Corentin Kittel, a full-stack developer passionate about interface design and user experience."
    },
    "roddat": {
      "title": "Roddat | Project by Corentin Kittel",
      "description": "Explore Roddat, a project by Corentin Kittel, a full-stack developer passionate about interface design and user experience."
    },
    "abject-act": {
      "title": "Abject Act | Project by Corentin Kittel",
      "description": "Explore Abject Act, a project by Corentin Kittel, a full-stack developer passionate about interface design and user experience."
    }
  },
  "not-found": {
    "content": "The page you are looking for does not exist. Please return to the home page.",
    "button": "Go back to home page"
  },
  "error": {
    "content": "Something went wrong. Please try again later.",
    "button": "Go back to home page"
  }
}
